void main() {
// Завдання 1: Математичні оператори
// 1) Створіть змінні довжина і ширина прямокутника (ширина 18.4, висота 30.9)
// 2) Обчисліть площу і периметр прямокутника.
// 3) Виведіть площу і периметр.
// 4) Використайте оператор ~/ для обчислення скільки повних квадратів 1х1 вміщається у площу.
 {
  double width = 18.4;
  double height = 30.9;
  double area = width * height;
  double perimeter = 2 * (width + height);

  print('Площа прямокутника: $area');       
  print('Периметр прямокутника: $perimeter'); 

  int fullSquares = area ~/ 1; 
  print('Повних квадратів 1x1 у площі: $fullSquares');
}
}